open-watt/urt/src/urt/driver/esp32/ow_shim.c
// OpenWatt ESP-IDF shim -- the single C bridge between D and ESP-IDF.
// Wraps FreeRTOS macros, UART HAL inlines, and anything else that
// needs C headers or static-inline access.

#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "driver/uart.h"
#include "driver/ledc.h"
#include "esp_rom_serial_output.h"
#include "soc/soc_caps.h"
#include <stdbool.h>
#include <stdatomic.h>
#include <string.h>
#include <sys/types.h>
#include <reent.h>
#ifdef OW_USE_LWIP
#include "lwip/netdb.h"
#endif

// ESP32-C3 ROM exports uart_tx_one_char but not esp_rom_uart_putc.
// Provide the missing symbol so the D object links.
#if defined(CONFIG_IDF_TARGET_ESP32C3) && !defined(esp_rom_uart_putc)
void esp_rom_uart_putc(char c) { esp_rom_output_tx_one_char(c); }
#endif

// -- errno accessor (picolibc uses _Thread_local errno, incompatible with emulated-TLS) --

#include <errno.h>

int *ow_errno_location(void)
{
    return &errno;
}

// IDF's no-VFS syscall adapter also dispatches high file descriptors to lwIP.
// Internal-IP builds wrap those entry points so ordinary C stdio stays on the
// console without retaining the socket adapter and, through it, the full stack.
extern ssize_t _write_r_console(struct _reent *r, int fd, const void *data, size_t size);
extern ssize_t _read_r_console(struct _reent *r, int fd, void *data, size_t size);

ssize_t __wrap__write_r(struct _reent *r, int fd, const void *data, size_t size)
{
    return _write_r_console(r, fd, data, size);
}

ssize_t __wrap__read_r(struct _reent *r, int fd, void *data, size_t size)
{
    return _read_r_console(r, fd, data, size);
}

int __wrap__close_r(struct _reent *r, int fd)
{
    (void)fd;
    __errno_r(r) = ENOSYS;
    return -1;
}

int __wrap__fcntl_r(struct _reent *r, int fd, int cmd, int arg)
{
    (void)fd;
    (void)cmd;
    (void)arg;
    __errno_r(r) = ENOSYS;
    return -1;
}

// -- WFI shim --
// Single-instruction inline asm; bound from D as ow_irq_wait. The
// surrounding portENTER_CRITICAL pair is handled D-side via direct
// vPortEnterCritical/vPortExitCritical bindings -- no C wrapper needed.

void ow_irq_wait(void)
{
#if CONFIG_IDF_TARGET_ARCH_XTENSA
    __asm__ volatile("waiti 0");
#elif CONFIG_IDF_TARGET_ARCH_RISCV
    __asm__ volatile("wfi");
#endif
}

// -- GPIO wrappers (software GPIO; peripheral function routing goes
//    through ESP-IDF's signal matrix on a per-peripheral basis, not
//    through this module).

#include "driver/gpio.h"
#include "esp_attr.h"
#include "esp_intr_alloc.h"
#include "soc/gpio_num.h"
#include "soc/gpio_struct.h"
#include "soc/interrupts.h"
#include <stdint.h>

// pull: 0=none, 1=up, 2=down (matches D Pull enum encoding)
static gpio_pull_mode_t ow_pull_to_idf(int pull)
{
    return (pull == 1) ? GPIO_PULLUP_ONLY :
           (pull == 2) ? GPIO_PULLDOWN_ONLY : GPIO_FLOATING;
}

void ow_gpio_output_init(int pin, int initial)
{
    gpio_reset_pin((gpio_num_t)pin);
    gpio_set_direction((gpio_num_t)pin, GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)pin, initial);
}

void ow_gpio_input_init(int pin, int pull)
{
    gpio_reset_pin((gpio_num_t)pin);
    gpio_set_direction((gpio_num_t)pin, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t)pin, ow_pull_to_idf(pull));
}

void IRAM_ATTR ow_gpio_output_set(int pin, int value)
{
    gpio_set_level((gpio_num_t)pin, value);
}

int ow_gpio_input_read(int pin)
{
    return gpio_get_level((gpio_num_t)pin);
}

void ow_gpio_set_pull(int pin, int pull)
{
    gpio_set_pull_mode((gpio_num_t)pin, ow_pull_to_idf(pull));
}

void ow_gpio_release(int pin)
{
    gpio_reset_pin((gpio_num_t)pin);
}

uint32_t ow_gpio_count(void)
{
    return SOC_GPIO_PIN_COUNT;
}

int ow_pwm_open(unsigned port, unsigned pin, unsigned frequency, unsigned resolution, unsigned initial_duty, bool inverted)
{
    if (port >= LEDC_TIMER_MAX || port >= LEDC_CHANNEL_MAX)
        return -1;

    ledc_timer_config_t timer = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .duty_resolution = (ledc_timer_bit_t)resolution,
        .timer_num = (ledc_timer_t)port,
        .freq_hz = frequency,
        .clk_cfg = LEDC_AUTO_CLK,
    };
    ledc_channel_config_t channel = {
        .gpio_num = pin,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = (ledc_channel_t)port,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = (ledc_timer_t)port,
        .duty = initial_duty,
        .hpoint = 0,
        .flags = { .output_invert = inverted },
    };
    if (ledc_timer_config(&timer) != ESP_OK)
        return -1;
    return ledc_channel_config(&channel) == ESP_OK ? 0 : -1;
}

int ow_pwm_set_duty(unsigned port, unsigned duty)
{
    if (port >= LEDC_CHANNEL_MAX || ledc_set_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)port, duty) != ESP_OK)
        return -1;
    return ledc_update_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)port) == ESP_OK ? 0 : -1;
}

void ow_pwm_close(unsigned port)
{
    if (port < LEDC_CHANNEL_MAX)
        ledc_stop(LEDC_LOW_SPEED_MODE, (ledc_channel_t)port, 0);
}

// -- Counter wrappers --

#include "driver/gptimer.h"

#if defined(CONFIG_IDF_TARGET_ESP32)

#if !CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM || !CONFIG_GPTIMER_ISR_CACHE_SAFE
#error "counter alarms rearm from interrupt context; enable CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM and CONFIG_GPTIMER_ISR_CACHE_SAFE"
#endif

#define OW_COUNTERS 4

typedef struct {
    bool (*callback)(unsigned port);
    gptimer_handle_t timer;
    gptimer_alarm_config_t alarm;
    portMUX_TYPE lock;
    unsigned port;
    bool started;
    bool enabled;
    bool open;
} ow_counter_t;

static ow_counter_t counters[OW_COUNTERS] = {
    { .lock = portMUX_INITIALIZER_UNLOCKED },
    { .lock = portMUX_INITIALIZER_UNLOCKED },
    { .lock = portMUX_INITIALIZER_UNLOCKED },
    { .lock = portMUX_INITIALIZER_UNLOCKED },
};

static bool IRAM_ATTR counter_alarm(gptimer_handle_t timer, const gptimer_alarm_event_data_t *event, void *context)
{
    (void)timer;
    (void)event;
    ow_counter_t *counter = context;
    bool (*callback)(unsigned);
    portENTER_CRITICAL_ISR(&counter->lock);
    callback = counter->callback;
    portEXIT_CRITICAL_ISR(&counter->lock);
    return callback ? callback(counter->port) : false;
}

void ow_counter_close(unsigned port);

int ow_counter_open(unsigned port, unsigned resolution_hz)
{
    if (port >= OW_COUNTERS || !resolution_hz)
        return -1;
    ow_counter_t *counter = &counters[port];
    if (counter->open)
        return -1;

    gptimer_config_t config = {
        .clk_src = GPTIMER_CLK_SRC_DEFAULT,
        .direction = GPTIMER_COUNT_UP,
        .resolution_hz = resolution_hz,
    };
    gptimer_event_callbacks_t callbacks = {
        .on_alarm = counter_alarm,
    };
    counter->port = port;
    counter->open = true;
    if (gptimer_new_timer(&config, &counter->timer) != ESP_OK ||
        gptimer_register_event_callbacks(counter->timer, &callbacks, counter) != ESP_OK)
        goto failed;
    if (gptimer_enable(counter->timer) != ESP_OK)
        goto failed;
    counter->enabled = true;
    return 0;

failed:
    ow_counter_close(port);
    return -1;
}

