open-watt/urt/src/urt/driver/esp32/ow_shim.c
static void IRAM_ATTR gpio_interrupt_handler(void *context)
{
    unsigned port = (unsigned)(uintptr_t)context;
    bool (*callback)(unsigned) = (bool (*)(unsigned))gpio_interrupt_callbacks[port];
    if (callback && callback(port))
        portYIELD_FROM_ISR();
}

void ow_gpio_interrupt_close(unsigned port);

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    if (port >= OW_GPIO_INTERRUPTS || input_gpio >= SOC_GPIO_PIN_COUNT || trigger > 4)
        return -1;

    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (interrupt->open || gpio_isr_acquire() != 0)
        return -1;
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
        GPIO_INTR_HIGH_LEVEL,
        GPIO_INTR_LOW_LEVEL,
    };
    interrupt->input_gpio = input_gpio;
    // Input buffer explicitly: the pin may be muxed to a peripheral output (only the output path is
    // routed), and edge detection needs GPIO_IN regardless of who drives the pad.
    if (gpio_input_enable((gpio_num_t)input_gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)input_gpio, types[trigger]) != ESP_OK ||
        gpio_isr_handler_add((gpio_num_t)input_gpio, gpio_interrupt_handler, (void *)(uintptr_t)port) != ESP_OK) {
        gpio_isr_release();
        return -1;
    }
    interrupt->open = true;
    return 0;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    gpio_interrupt_callbacks[port] = (uintptr_t)callback;
}

void ow_gpio_interrupt_close(unsigned port)
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (!interrupt->open)
        return;
    gpio_isr_handler_remove((gpio_num_t)interrupt->input_gpio);
    ow_gpio_interrupt_set_callback(port, NULL);
    interrupt->open = false;
    gpio_isr_release();
}

// -- Link fabric gpio events (dispatcher lives in D: ow_link_fire) --

extern bool ow_link_fire(unsigned slot);

static void IRAM_ATTR link_gpio_handler(void *context)
{
    if (ow_link_fire((unsigned)(uintptr_t)context))
        portYIELD_FROM_ISR();
}

int ow_link_gpio_open(unsigned slot, unsigned gpio, unsigned trigger)
{
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
    };
    if (gpio >= SOC_GPIO_PIN_COUNT || trigger > 2)
        return -1;
    if (gpio_isr_acquire() != 0)
        return -1;
    // Input buffer explicitly: the pin may be muxed to a peripheral output (only the output path is
    // routed), and edge detection needs GPIO_IN regardless of who drives the pad.
    if (gpio_input_enable((gpio_num_t)gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)gpio, types[trigger]) != ESP_OK ||
        gpio_isr_handler_add((gpio_num_t)gpio, link_gpio_handler, (void *)(uintptr_t)slot) != ESP_OK) {
        gpio_isr_release();
        return -1;
    }
    return 0;
}

void ow_link_gpio_close(unsigned slot, unsigned gpio)
{
    (void)slot;
    if (gpio >= SOC_GPIO_PIN_COUNT)
        return;
    gpio_isr_handler_remove((gpio_num_t)gpio);
    gpio_isr_release();
}

// -- Reflex NMI routing (the handler itself is synthesized in D: xt_nmi) --

static intr_handle_t reflex_nmi_handle;
static unsigned reflex_users;

int ow_reflex_open(unsigned gpio, unsigned trigger)
{
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
    };
    if (gpio >= 32 || trigger > 2)
        return -1;
    if (!reflex_users) {
        // Route the GPIO NMI matrix source to CPU interrupt 14 (level 7). High-level
        // allocation requires a NULL handler; the vector dispatches to xt_nmi directly.
        if (esp_intr_alloc(ETS_GPIO_NMI_SOURCE, ESP_INTR_FLAG_NMI, NULL, NULL, &reflex_nmi_handle) != ESP_OK)
            return -1;
    }
    if (gpio_input_enable((gpio_num_t)gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)gpio, types[trigger]) != ESP_OK) {
        if (!reflex_users) {
            esp_intr_free(reflex_nmi_handle);
            reflex_nmi_handle = NULL;
        }
        return -1;
    }
    ++reflex_users;
    // Per-pin register and the pin is claimed exclusively, so the RMW races nothing.
    GPIO.pin[gpio].int_ena |= BIT(3);   /* PRO CPU NMI */
    return 0;
}

void ow_reflex_close(unsigned gpio)
{
    if (gpio >= 32 || !reflex_users)
        return;
    GPIO.pin[gpio].int_ena &= ~BIT(3);
    gpio_set_intr_type((gpio_num_t)gpio, GPIO_INTR_DISABLE);
    if (--reflex_users == 0 && reflex_nmi_handle) {
        esp_intr_free(reflex_nmi_handle);
        reflex_nmi_handle = NULL;
    }
}

#else

int ow_adc_open(unsigned unit, void **handle)
{
    (void)unit;
    (void)handle;
    return -1;
}

int ow_adc_input_open(void *handle, unsigned unit, unsigned channel, unsigned attenuation, unsigned bit_width, unsigned default_reference_mv, void **calibration, int *calibration_source)
{
    (void)handle;
    (void)unit;
    (void)channel;
    (void)attenuation;
    (void)bit_width;
    (void)default_reference_mv;
    (void)calibration;
    (void)calibration_source;
    return -1;
}

int ow_adc_read(void *handle, unsigned unit, unsigned channel, unsigned *raw)
{
    (void)handle;
    (void)unit;
    (void)channel;
    (void)raw;
    return -1;
}

int ow_adc_read_critical(unsigned channel, unsigned *raw)
{
    (void)channel;
    (void)raw;
    return -1;
}

int ow_adc_raw_to_mv(void *calibration, unsigned raw, unsigned *millivolts)
{
    (void)calibration;
    (void)raw;
    (void)millivolts;
    return -1;
}

void ow_adc_input_close(void *calibration)
{
    (void)calibration;
}

void ow_adc_close(void *handle)
{
    (void)handle;
}

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    (void)port;
    (void)input_gpio;
    (void)trigger;
    return -1;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    (void)port;
    (void)callback;
}

