open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_i2c_submit(void *context_ptr, uint16_t address, uint8_t address_mode, uint32_t frequency, const void *write_data, size_t write_length, void *read_data, size_t read_length, int timeout_ms, ow_i2c_callback_t callback, void *callback_context)
{
    ow_i2c_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || !callback || (write_length == 0 && read_length == 0))
        return -1;

    ow_i2c_request_t request = {
        .address = address,
        .frequency = frequency,
        .address_mode = address_mode,
        .write_data = write_data,
        .write_length = write_length,
        .read_data = read_data,
        .read_length = read_length,
        .timeout_ms = timeout_ms,
        .callback = callback,
        .callback_context = callback_context,
    };
    return xQueueSend(context->queue, &request, 0) == pdTRUE ? 0 : -1;
}


// -- SPI master wrappers --

#include "driver/spi_master.h"
#include "esp_rom_gpio.h"
#include "soc/gpio_sig_map.h"
#include "soc/spi_periph.h"

// SPI1 is the flash controller; only the general-purpose hosts are exposed.
#define OW_SPI_COUNT (SOC_SPI_PERIPH_NUM - 1)

typedef bool (*ow_spi_callback_t)(void *context, int result);

typedef struct {
    spi_device_handle_t device;
    spi_host_device_t host;
    int mosi_gpio;
    spi_transaction_t transaction;
    ow_spi_callback_t callback;
    void *callback_context;
    void *read_data;
    size_t read_length;
    atomic_bool initialized;
} ow_spi_context_t;

static ow_spi_context_t spi_contexts[OW_SPI_COUNT];

// Runs in the SPI completion interrupt: SPI_DEVICE_NO_RETURN_RESULT means the descriptor is never posted back to a task.
static void IRAM_ATTR ow_spi_post(spi_transaction_t *transaction)
{
    ow_spi_context_t *context = transaction->user;
    if (!context)
        return;                 // priming transfer at open: no caller to notify

    // Only the descriptor-resident small-transfer path needs a copy out; DMA wrote straight into the caller's buffer.
    uint8_t *destination = context->read_data;
    for (size_t i = 0; i < context->read_length; ++i)
        destination[i] = transaction->rx_data[i];

    if (context->callback(context->callback_context, 0))
        portYIELD_FROM_ISR();
}

uint32_t ow_spi_count(void)
{
    return OW_SPI_COUNT;
}

void *ow_spi_open(unsigned port, int sck_gpio, int mosi_gpio, int miso_gpio, int cs_gpio, uint32_t frequency, uint8_t mode)
{
    if (port >= OW_SPI_COUNT)
        return NULL;

    ow_spi_context_t *context = &spi_contexts[port];
    if (atomic_exchange_explicit(&context->initialized, true, memory_order_acq_rel))
        return NULL;

    context->host = SPI2_HOST + port;
    context->mosi_gpio = mosi_gpio;
    spi_bus_config_t bus_config = {
        .sclk_io_num = sck_gpio,
        .mosi_io_num = mosi_gpio,
        .miso_io_num = miso_gpio,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096,
    };
    bool bus_initialized = false;
    if (spi_bus_initialize(context->host, &bus_config, SPI_DMA_CH_AUTO) != ESP_OK)
        goto fail;
    bus_initialized = true;

    spi_device_interface_config_t device_config = {
        .clock_speed_hz = (int)frequency,
        .mode = mode,
        .spics_io_num = cs_gpio,
        .queue_size = 1,
        .flags = SPI_DEVICE_NO_RETURN_RESULT,
        .post_cb = ow_spi_post,
    };
    if (spi_bus_add_device(context->host, &device_config, &context->device) != ESP_OK)
        goto fail;

    // SCLK only settles at the mode's idle level once a transaction has run. A device with no
    // chip-select has no frame delimiter, so it counts the first edge after open as data and
    // every subsequent byte lands shifted. Prime the line before any caller can transmit.
    spi_transaction_t priming = {
        .length = 8,
        .flags = SPI_TRANS_USE_TXDATA,
    };
    spi_device_polling_transmit(context->device, &priming);
    return context;

fail:
    if (bus_initialized)
        spi_bus_free(context->host);
    atomic_store_explicit(&context->initialized, false, memory_order_release);
    return NULL;
}

void ow_spi_close(void *context_ptr)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_exchange_explicit(&context->initialized, false, memory_order_acq_rel))
        return;

    spi_bus_remove_device(context->device);
    context->device = NULL;
    spi_bus_free(context->host);
}

int ow_spi_submit(void *context_ptr, const void *write_data, size_t write_length, void *read_data, size_t read_length, ow_spi_callback_t callback, void *callback_context)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || !callback || (write_length == 0 && read_length == 0))
        return -1;
    // spi_device_queue_trans takes a FreeRTOS queue with task-context semantics, so a completion callback cannot resubmit directly.
    if (xPortInIsrContext())
        return -1;

    size_t length = write_length > read_length ? write_length : read_length;
    spi_transaction_t *transaction = &context->transaction;
    memset(transaction, 0, sizeof(*transaction));
    transaction->length = length * 8;
    transaction->user = context;

    context->callback = callback;
    context->callback_context = callback_context;
    context->read_data = read_data;
    context->read_length = 0;

    if (length <= 4)
    {
        // Small transfers ride inside the descriptor, so command bytes may live in flash rather than DMA-capable RAM.
        if (write_length)
        {
            transaction->flags |= SPI_TRANS_USE_TXDATA;
            memcpy(transaction->tx_data, write_data, write_length);
        }
        if (read_length)
        {
            transaction->flags |= SPI_TRANS_USE_RXDATA;
            context->read_length = read_length;
        }
    }
    else
    {
        transaction->tx_buffer = write_length ? write_data : NULL;
        transaction->rx_buffer = read_length ? read_data : NULL;
        if (read_length)
            transaction->rxlength = read_length * 8;
    }

