open-watt/urt/src/urt/driver/esp32/ow_shim.c
    return spi_device_queue_trans(context->device, transaction, 0) == ESP_OK ? 0 : -1;
}

int ow_spi_suspend(void *context_ptr)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || context->mosi_gpio < 0)
        return -1;
    // Hand MOSI's output stage back to the GPIO output register; the caller may now re-init and sample the pin.
    esp_rom_gpio_connect_out_signal(context->mosi_gpio, SIG_GPIO_OUT_IDX, false, false);
    return 0;
}

int ow_spi_resume(void *context_ptr)
{
    ow_spi_context_t *context = context_ptr;
    if (!context || !atomic_load_explicit(&context->initialized, memory_order_acquire) || context->mosi_gpio < 0)
        return -1;
    gpio_set_direction((gpio_num_t)context->mosi_gpio, GPIO_MODE_OUTPUT);
    esp_rom_gpio_connect_out_signal(context->mosi_gpio, spi_periph_signal[context->host].spid_out, false, false);
    return 0;
}


// -- UART driver wrappers --

#define NUM_UARTS SOC_UART_NUM
#define UART_RX_BUFFER_SIZE 1024
#define UART_TX_BUFFER_SIZE 1024
#define UART_EVENT_QUEUE_SIZE 16
#define UART_EVENT_TASK_STACK 3072

typedef void (*ow_uart_rx_ready_cb_t)(unsigned port, size_t available);

static atomic_bool uart_initialized[NUM_UARTS];
static QueueHandle_t uart_event_queue[NUM_UARTS];
static TaskHandle_t uart_event_task[NUM_UARTS];
static SemaphoreHandle_t uart_event_task_done[NUM_UARTS];
static StaticSemaphore_t uart_event_task_done_storage[NUM_UARTS];
static atomic_uint uart_errors[NUM_UARTS];
static _Atomic(ow_uart_rx_ready_cb_t) uart_rx_ready[NUM_UARTS];

// D enums: StopBits { half=0, one=1, one_point_five=2, two=3 }
//          Parity   { none=0, even=1, odd=2, mark=3, space=4 }
static const uart_stop_bits_t stop_bits_map[] = {
    UART_STOP_BITS_1, UART_STOP_BITS_1, UART_STOP_BITS_1_5, UART_STOP_BITS_2
};
static const uart_parity_t parity_map[] = {
    UART_PARITY_DISABLE, UART_PARITY_EVEN, UART_PARITY_ODD,
    UART_PARITY_DISABLE, UART_PARITY_DISABLE
};

static void ow_uart_event_task(void *argument)
{
    unsigned port = (unsigned)(uintptr_t)argument;
    uart_event_t event;

    while (xQueueReceive(uart_event_queue[port], &event, portMAX_DELAY) == pdTRUE)
    {
        if (event.type == UART_EVENT_MAX)
            break;

        unsigned error = 0;
        switch (event.type)
        {
            case UART_DATA:
            {
                size_t available = event.size;
                uart_get_buffered_data_len((uart_port_t)port, &available);
                ow_uart_rx_ready_cb_t callback = atomic_load_explicit(
                    &uart_rx_ready[port], memory_order_acquire);
                if (callback)
                    callback(port, available);
                continue;
            }
            case UART_BREAK:
                error = 1u << 4;
                break;
            case UART_BUFFER_FULL:
            case UART_FIFO_OVF:
                error = 1u << 2;
                uart_flush_input((uart_port_t)port);
                break;
            case UART_FRAME_ERR:
                error = 1u << 0;
                break;
            case UART_PARITY_ERR:
                error = 1u << 1;
                break;
            default:
                continue;
        }

        atomic_fetch_or_explicit(&uart_errors[port], error, memory_order_relaxed);
        ow_uart_rx_ready_cb_t callback = atomic_load_explicit(&uart_rx_ready[port], memory_order_acquire);
        if (callback)
            callback(port, 0);
    }

    xSemaphoreGive(uart_event_task_done[port]);
    vTaskDelete(NULL);
}

int ow_uart_open(unsigned port, uint32_t baud_rate, uint8_t data_bits,
                 uint8_t stop_bits, uint8_t parity,
                 int8_t tx_gpio, int8_t rx_gpio,
                 bool rs485_enabled, int8_t de_gpio, bool de_active_high,
                 ow_uart_rx_ready_cb_t rx_ready)
{
    if (port >= NUM_UARTS || atomic_load_explicit(&uart_initialized[port], memory_order_acquire) || data_bits < 5 || data_bits > 8)
        return 0;

    uart_config_t config = {0};
    config.baud_rate = (int)baud_rate;
    config.data_bits = (uart_word_length_t)(UART_DATA_5_BITS + data_bits - 5);
    config.parity = parity < sizeof(parity_map) / sizeof(parity_map[0]) ? parity_map[parity] : UART_PARITY_DISABLE;
    config.stop_bits = stop_bits < sizeof(stop_bits_map) / sizeof(stop_bits_map[0]) ? stop_bits_map[stop_bits] : UART_STOP_BITS_1;
    config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
    config.source_clk = UART_SCLK_DEFAULT;

    uart_port_t uart = (uart_port_t)port;
    if (uart_param_config(uart, &config) != ESP_OK ||
        uart_set_pin(uart, tx_gpio, rx_gpio, de_gpio, UART_PIN_NO_CHANGE) != ESP_OK ||
        uart_driver_install(uart, UART_RX_BUFFER_SIZE, UART_TX_BUFFER_SIZE, UART_EVENT_QUEUE_SIZE, &uart_event_queue[port], 0) != ESP_OK)
    {
        uart_event_queue[port] = NULL;
        return 0;
    }

    uint32_t inverse = rs485_enabled && !de_active_high ? UART_SIGNAL_RTS_INV : 0;
    if (uart_set_line_inverse(uart, inverse) != ESP_OK)
    {
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }
    if (rs485_enabled && uart_set_mode(uart, UART_MODE_RS485_HALF_DUPLEX) != ESP_OK)
    {
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }

    if (!uart_event_task_done[port])
        uart_event_task_done[port] = xSemaphoreCreateBinaryStatic(&uart_event_task_done_storage[port]);
    if (!uart_event_task_done[port])
    {
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }
    xSemaphoreTake(uart_event_task_done[port], 0);

    atomic_store_explicit(&uart_errors[port], 0, memory_order_relaxed);
    atomic_store_explicit(&uart_rx_ready[port], rx_ready, memory_order_release);
    atomic_store_explicit(&uart_initialized[port], true, memory_order_release);
    if (xTaskCreate(ow_uart_event_task, "ow-uart", UART_EVENT_TASK_STACK, (void *)(uintptr_t)port, tskIDLE_PRIORITY + 2, &uart_event_task[port]) != pdPASS)
    {
        atomic_store_explicit(&uart_initialized[port], false, memory_order_release);
        atomic_store_explicit(&uart_rx_ready[port], NULL, memory_order_release);
        uart_driver_delete(uart);
        uart_event_queue[port] = NULL;
        return 0;
    }
    return 1;
}

