open-watt/urt/src/urt/driver/esp32/ow_shim.c
#if SOC_TWAI_SUPPORTED
#include "esp_twai.h"
#include "esp_twai_onchip.h"

#define OW_CAN_RX_CAP 32
#define OW_CAN_TX_CAP 16

_Static_assert((OW_CAN_RX_CAP & (OW_CAN_RX_CAP - 1)) == 0, "CAN RX capacity must be a power of two");
_Static_assert(OW_CAN_TX_CAP <= 32, "CAN TX capacity exceeds the ownership bitmap");

typedef bool (*ow_can_rx_cb_t)(unsigned port);

typedef struct {
    uint32_t id;
    uint8_t flags;
    uint8_t dlc;
    uint8_t data[8];
} ow_can_frame_t;

typedef struct {
    twai_frame_t frame;
    uint8_t data[8];
} ow_can_tx_slot_t;

typedef struct {
    twai_node_handle_t handle;
    unsigned port;
    ow_can_rx_cb_t rx_cb;
    _Atomic uint32_t rx_head;
    _Atomic uint32_t rx_tail;
    _Atomic uint32_t rx_drops;
    _Atomic uint32_t errors;
    _Atomic uint32_t tx_used;
    ow_can_frame_t rx[OW_CAN_RX_CAP];
    ow_can_tx_slot_t tx[OW_CAN_TX_CAP];
} ow_can_context_t;

static ow_can_context_t ow_can_contexts[SOC_TWAI_CONTROLLER_NUM];

static ow_can_context_t *ow_can_find(twai_node_handle_t handle)
{
    if (!handle)
        return NULL;
    for (unsigned i = 0; i < SOC_TWAI_CONTROLLER_NUM; ++i)
        if (ow_can_contexts[i].handle == handle)
            return &ow_can_contexts[i];
    return NULL;
}

static bool ow_can_rx_done(twai_node_handle_t handle, const twai_rx_done_event_data_t *edata, void *user_ctx)
{
    (void)edata;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    uint8_t data[64];
    twai_frame_t frame = {
        .buffer = data,
        .buffer_len = sizeof(data),
    };
    if (twai_node_receive_from_isr(handle, &frame) != ESP_OK)
        return false;

    uint16_t length = twaifd_dlc2len(frame.header.dlc);
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_relaxed);
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_acquire);
    if (length > sizeof(ctx->rx[0].data))
    {
        // The portable frame carries only classic-CAN payloads. Account unsupported FD frames as drops, not queue overruns.
        atomic_fetch_add_explicit(&ctx->rx_drops, 1, memory_order_relaxed);
        return false;
    }
    if (head - tail >= OW_CAN_RX_CAP)
    {
        atomic_fetch_add_explicit(&ctx->rx_drops, 1, memory_order_relaxed);
        atomic_fetch_or_explicit(&ctx->errors, 1u << 5, memory_order_relaxed);
        return false;
    }

    ow_can_frame_t *slot = &ctx->rx[head & (OW_CAN_RX_CAP - 1)];
    slot->id = frame.header.id;
    slot->flags = (frame.header.ide ? 1 : 0) | (frame.header.rtr ? 2 : 0) | (frame.header.fdf ? 4 : 0) | (frame.header.brs ? 8 : 0);
    slot->dlc = (uint8_t)length;
    if (frame.header.rtr)
        memset(slot->data, 0, sizeof(slot->data));
    else if (length > 0)
        memcpy(slot->data, data, length);
    atomic_store_explicit(&ctx->rx_head, head + 1, memory_order_release);
    return ctx->rx_cb ? ctx->rx_cb(ctx->port) : false;
}

static bool ow_can_tx_done(twai_node_handle_t handle, const twai_tx_done_event_data_t *edata, void *user_ctx)
{
    (void)handle;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    if (!edata->is_tx_success)
        atomic_fetch_or_explicit(&ctx->errors, 1u << 4, memory_order_relaxed);
    if (edata->done_tx_frame)
    {
        ow_can_tx_slot_t *slot = (ow_can_tx_slot_t *)edata->done_tx_frame;
        unsigned index = (unsigned)(slot - ctx->tx);
        if (index < OW_CAN_TX_CAP)
            atomic_fetch_and_explicit(&ctx->tx_used, ~(1u << index), memory_order_release);
    }
    return false;
}

static bool ow_can_error(twai_node_handle_t handle, const twai_error_event_data_t *edata, void *user_ctx)
{
    (void)handle;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    uint32_t errors = 0;
    // ESP-IDF 6.0 exposes arbitration, bit, form, stuff, and ACK flags here, but no CRC flag.
    if (edata->err_flags.bit_err)
        errors |= 1u << 0;
    if (edata->err_flags.stuff_err)
        errors |= 1u << 1;
    if (edata->err_flags.form_err)
        errors |= 1u << 3;
    if (edata->err_flags.ack_err)
        errors |= 1u << 4;
    atomic_fetch_or_explicit(&ctx->errors, errors, memory_order_relaxed);
    return false;
}

twai_node_handle_t ow_can_open(unsigned port, uint32_t bitrate, int tx_gpio, int rx_gpio, uint8_t sjw, uint8_t tseg1, uint8_t tseg2, uint16_t brp, ow_can_rx_cb_t rx_cb)
{
    if (port >= SOC_TWAI_CONTROLLER_NUM || bitrate == 0 || tx_gpio < 0 || rx_gpio < 0)
        return NULL;

    ow_can_context_t *ctx = &ow_can_contexts[port];
    if (ctx->handle)
        return ctx->handle;

    twai_onchip_node_config_t config = {
        .io_cfg = {
            .tx = tx_gpio,
            .rx = rx_gpio,
            .quanta_clk_out = -1,
            .bus_off_indicator = -1,
        },
        .bit_timing = {
            .bitrate = bitrate,
        },
        .fail_retry_cnt = -1,
        .tx_queue_depth = OW_CAN_TX_CAP,
    };

    twai_node_handle_t handle = NULL;
    if (twai_new_node_onchip(&config, &handle) != ESP_OK)
        return NULL;

    if (brp > 0)
    {
        twai_timing_advanced_config_t timing = {
            .brp = brp,
            .tseg_1 = tseg1,
            .tseg_2 = tseg2,
            .sjw = sjw,
        };
        if (twai_node_reconfig_timing(handle, &timing, NULL) != ESP_OK)
        {
            twai_node_delete(handle);
            return NULL;
        }
    }

    memset(ctx, 0, sizeof(*ctx));
    ctx->handle = handle;
    ctx->port = port;
    ctx->rx_cb = rx_cb;

    const twai_event_callbacks_t callbacks = {
        .on_tx_done = &ow_can_tx_done,
        .on_rx_done = &ow_can_rx_done,
        .on_error = &ow_can_error,
    };
    if (twai_node_register_event_callbacks(handle, &callbacks, ctx) != ESP_OK || twai_node_enable(handle) != ESP_OK)
    {
        ctx->handle = NULL;
        twai_node_delete(handle);
        return NULL;
    }
    return handle;
}

void ow_can_close(twai_node_handle_t handle)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx)
        return;
    twai_node_disable(handle);
    twai_node_delete(handle);
    memset(ctx, 0, sizeof(*ctx));
}

bool ow_can_transmit(twai_node_handle_t handle, uint32_t id, uint8_t flags, uint8_t dlc, const uint8_t *data)
{
    ow_can_context_t *ctx = ow_can_find(handle);
    if (!ctx || dlc > 8 || (!data && dlc > 0))
        return false;

    uint32_t used = atomic_load_explicit(&ctx->tx_used, memory_order_relaxed);
    unsigned index;
    for (;;)
    {
        for (index = 0; index < OW_CAN_TX_CAP; ++index)
            if (!(used & (1u << index)))
                break;
        if (index == OW_CAN_TX_CAP)
            return false;
        uint32_t desired = used | (1u << index);
        if (atomic_compare_exchange_weak_explicit(&ctx->tx_used, &used, desired, memory_order_acquire, memory_order_relaxed))
            break;
    }

    ow_can_tx_slot_t *slot = &ctx->tx[index];
    memset(slot, 0, sizeof(*slot));
    slot->frame.header.id = id;
    slot->frame.header.dlc = dlc;
    slot->frame.header.ide = (flags & 1) != 0;
    slot->frame.header.rtr = (flags & 2) != 0;
    slot->frame.header.fdf = (flags & 4) != 0;
    slot->frame.header.brs = (flags & 8) != 0;
    slot->frame.buffer = slot->data;
    slot->frame.buffer_len = dlc;
    if (!(flags & 2) && dlc > 0)
        memcpy(slot->data, data, dlc);

