open-watt/urt/src/urt/driver/esp32/ow_shim.c
ptrdiff_t urt_spiffs_read(int fd, void *buffer, size_t length)
{
    return read(fd, buffer, length);
}

static int ow_spiffs_last_errno = 0;

int urt_spiffs_info(uint64_t *total, uint64_t *used)
{
    if (!ow_spiffs_ready())
        return -1;
    size_t t = 0, u = 0;
    esp_err_t err = esp_spiffs_info(NULL, &t, &u);
    *total = t;
    *used = u;
    return err == ESP_OK ? 0 : -1;
}

int urt_spiffs_last_error(void)
{
    return ow_spiffs_last_errno;
}

// SPIFFS has no directories; its VFS reports the flat namespace as a single
// listing at the mount root, so only the root enumerates anything.
#define OW_SPIFFS_MAX_DIRS 2

static DIR *ow_spiffs_dirs[OW_SPIFFS_MAX_DIRS];

int urt_spiffs_dir_open(const char *path, size_t path_len)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return -1;

    int h = -1;
    for (int i = 0; i < OW_SPIFFS_MAX_DIRS; ++i)
    {
        if (!ow_spiffs_dirs[i])
        {
            h = i;
            break;
        }
    }
    if (h < 0)
        return -1;

    DIR *d = opendir(buffer);
    if (!d)
    {
        ow_spiffs_last_errno = errno;
        return -1;
    }
    ow_spiffs_dirs[h] = d;
    return h;
}

ptrdiff_t urt_spiffs_dir_read(int h, char *name, size_t name_len, uint64_t *size, int *is_dir)
{
    if (h < 0 || h >= OW_SPIFFS_MAX_DIRS || !ow_spiffs_dirs[h])
        return -1;

    errno = 0;
    struct dirent *e = readdir(ow_spiffs_dirs[h]);
    if (!e)
    {
        if (errno)
        {
            ow_spiffs_last_errno = errno;
            return -1;
        }
        return 0;
    }

    size_t len = strlen(e->d_name);
    if (len > name_len)
        len = name_len;
    memcpy(name, e->d_name, len);
    *is_dir = (e->d_type == DT_DIR);
    *size = 0;
    if (!*is_dir)
    {
        // d_name is relative to the directory, and there is no fstatat here.
        char full[128];
        int n = snprintf(full, sizeof(full), "%s/%s", OW_SPIFFS_ROOT, e->d_name);
        struct stat st;
        if (n > 0 && (size_t)n < sizeof(full) && stat(full, &st) == 0)
            *size = (uint64_t)st.st_size;
    }
    return (ptrdiff_t)len;
}

void urt_spiffs_dir_close(int h)
{
    if (h < 0 || h >= OW_SPIFFS_MAX_DIRS || !ow_spiffs_dirs[h])
        return;
    closedir(ow_spiffs_dirs[h]);
    ow_spiffs_dirs[h] = NULL;
}

ptrdiff_t urt_spiffs_write(int fd, const void *data, size_t length)
{
    ptrdiff_t n = write(fd, data, length);
    if (n < 0)
        ow_spiffs_last_errno = errno;
    return n;
}

void urt_spiffs_close(int fd)
{
    close(fd);
}

uint64_t urt_spiffs_size(int fd)
{
    struct stat st;
    return fstat(fd, &st) == 0 ? (uint64_t)st.st_size : 0;
}

int64_t urt_spiffs_seek(int fd, int64_t offset, int whence)
{
    return lseek(fd, (off_t)offset, whence);
}

int urt_spiffs_truncate(int fd, uint64_t length)
{
    return ftruncate(fd, (off_t)length);
}

int urt_spiffs_sync(int fd)
{
    return fsync(fd);
}

int urt_spiffs_unlink(const char *path, size_t path_len)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return -1;
    return unlink(buffer);
}

int urt_spiffs_rename(const char *from, size_t from_len, const char *to, size_t to_len)
{
    char from_buffer[128], to_buffer[128];
    if (!ow_spiffs_ready() ||
        !ow_spiffs_path(from, from_len, from_buffer, sizeof(from_buffer)) ||
        !ow_spiffs_path(to, to_len, to_buffer, sizeof(to_buffer)))
        return -1;
    return rename(from_buffer, to_buffer);
}

int urt_spiffs_stat(const char *path, size_t path_len, uint64_t *size)
{
    char buffer[128];
    if (!ow_spiffs_ready() || !ow_spiffs_path(path, path_len, buffer, sizeof(buffer)))
        return -1;
    struct stat st;
    if (stat(buffer, &st) != 0)
        return -1;
    *size = (uint64_t)st.st_size;
    return 0;
}

// Formatting a multi-megabyte partition blocks for long enough to starve the
// watchdog, so it runs on its own task and the caller polls for completion.
enum { OW_SPIFFS_FORMAT_IDLE = 0, OW_SPIFFS_FORMAT_RUNNING, OW_SPIFFS_FORMAT_COMPLETE, OW_SPIFFS_FORMAT_FAILED };

static volatile int ow_spiffs_format_state = OW_SPIFFS_FORMAT_IDLE;

static void ow_spiffs_format_task(void *argument)
{
    (void)argument;
    esp_err_t err = esp_spiffs_format(NULL);
    if (err == ESP_OK)
    {
        // Formatting leaves the partition mounted but unregistered; drop that so
        // the next access can register a VFS on it.
        if (!ow_spiffs_registered && esp_spiffs_mounted(NULL))
            esp_vfs_spiffs_unregister(NULL);
        ow_spiffs_mount_state = 0;
    }
    ow_spiffs_format_state = (err == ESP_OK) ? OW_SPIFFS_FORMAT_COMPLETE : OW_SPIFFS_FORMAT_FAILED;
    vTaskDelete(NULL);
}

int urt_spiffs_format_begin(void)
{
    if (ow_spiffs_format_state == OW_SPIFFS_FORMAT_RUNNING)
        return 0;
    ow_spiffs_format_state = OW_SPIFFS_FORMAT_RUNNING;
    if (xTaskCreate(ow_spiffs_format_task, "ow-spiffs-fmt", 4096, NULL, tskIDLE_PRIORITY + 1, NULL) != pdPASS)
    {
        ow_spiffs_format_state = OW_SPIFFS_FORMAT_FAILED;
        return -1;
    }
    return 0;
}

int urt_spiffs_available(void)
{
    return ow_spiffs_ready() ? 1 : 0;
}

int urt_spiffs_format_status(void)
{
    return ow_spiffs_format_state;
}

#endif // OW_USE_SPIFFS
